# 一、交换机
## 1、基础配置
### （1）配置SSH登录
SSH server上配置使用用户名和密码登录
```bash
SSHServer(config)# line vty 0
SSHServer(config-line)# login local
SSHServer(config-line)# exit
SSHServer(config)# username admin password ruijie
SSHServer(config)# enable password ruijie
SSHServer(config)# end
SSHServer# write
```
### （2）**如何修改交换机的登录密码？**
#### 修改登录设备的用户名和密码
```bash
Hostname(config)# no username admin
Hostname(config)# username admin password ruijie　　　　// 修改登录设备的用户名和密码`
Hostname(config)# line vty 0 63
Hostname(config-line)# password ruijie123　　// 只修改设备登录密码，用户名仍为admin`
```
####  修改进入特权模式的密码  
```bash
Hostname(config)# no enable secret
Hostname(config)# no enable password
Hostname(config)# enable password ruijie
```
####  修改登录设备的密码，设备允许以任意用户名登录  
```bash
Hostname(config)# line vty 0 4
Hostname(config-line)# password ruijie
Hostname(config-line)# login
```
### （3） 如何提高交换机的登录密码安全程度？  
密码策略为设备上需要配置账号与密码的应用（例如创建本地用户）提供密码检测功能，保障用户使用符合安全规范的密码，避免密码因为过于简单而遭到破解。为保证密码的复杂度，可通过在设备上配置以下命令来对用户的密码进行限制。
l  设置密码生存周期。
`password policy life-cycle life-cycle`
参数说明：
ｏ      _life-cycle_：配置口令生存周期。取值范围为1~65535，单位为天。
# 配置口令生存周期为15天。
```bash
Hostname(config)# password policy life-cycle 15
```
l  限制用户密码的最小长度。
`password policy min-size min-size`
参数说明：
ｏ      _min-size_：口令最小长度。取值范围为1~31。
# 配置用户口令的最小长度为8。
```bash
Hostname(config)# password policy min-size 8
```
l  配置在特定次数内，不允许用户使用相同密码。
`password policy no-repeat-times no-repeat-times`
参数说明：
ｏ      _no-repeat-times_：不允许用户重复使用指定次数内已经使用过的口令，取值范围为1~31。
# 限制用户口令重复使用，不允许重复使用最近5次配置过的口令。
```bash
Hostname(config)# password policy no-repeat-times 5
```
l  打开强密码检测功能。
`password policy strong`
强口令检测功能用于检测口令的复杂度，避免口令由于复杂度过低被轻易破解。对于以下情况，强口令检测功能会发出告警信息。
ｏ      口令与账号同名。
ｏ      口令只包含数字。
ｏ      口令只包含大写字母。
**ｏ**      口令只包含小写字母。
# 开启强口令检测功能
```bash
Hostname(config)# password policy strong
```
l  开启弱密码强制修改功能。
`password policy forced-password-modify`
# 开启弱口令强制修改功能。**.**
```bash
Hostname(config)# password policy forced-password-modify
```
l  开启检测密码特殊字符功能。
`password policy printable-character-check`
# 开启检测口令特殊字符功能。
```bash
Hostname(config)# password policy printable-character-check
```
l  设置密码加密存储
`service password-encryption`
# 开启口令加密存储功能
```bash
Hostname(config)# service password-encryption
```
### （4）**如何修改设备的本地时钟（NTP）？**
```bash
Hostname(config)# ntp server 192.168.2.1
Hostname(config)# ntp update-calendar
```
### （5）**如何使用WEB登录交换机？**
**配置步骤**
(1) 配置设备上的管理IP地址，使得与Web浏览器三层路由可达。
```bash
Device(config)# interface gigabitEthernet 0/1
Device(config-if-GigabitEthernet 0/1)# ip address 1.1.1.10 255.255.255.0
```
(2) 配置同时打开HTTP和HTTPS服务。
```bash
Device(config)# enable service web-server
```
(3) 配置HTTP服务端口号为8080。
```bash
Device(config)# http port 8080
```
(4) 配置HTTPS服务端口号为4430。
```bash
Device(config)# http secure-port 4430
```
(5) 配置HTTP认证信息。
```bash
Device(config)# webmaster level 1 username test1 password 0 test_password1
```
**验证配置结果**
# 通过**ping**命令查看设备与Web浏览器三层可通。
# 通过**show web-server status**命令查看HTTP服务的配置信息。
```bash
Device# show web-server status
http server status: enabled
http server port: 8080
https server status:enabled
https server port: 4430
```
# 通过浏览器登录1.1.1.10：8080，进入设备系统界面，输入用户名和密码，查看设备能否进入WEB界面。
### （6）如何创建本地账户密码？
```bash
username username privilege privilege-level [ nopassword | password [ 0 | 7 ] text-string | secret [ 0 | 5 | 8 ] text-string ]
```
相关参数说明如下：
ｏ      _username_：配置账户的用户名。
ｏ      **password** [ **0** | **7** ] _text-string_：配置账号的简单口令。其中**0**表示输入明文口令；**7**表示输入密文口令，缺省情况下未输入明文口令；_text-string_表示口令文本。
ｏ      **secret** [ **0** | **5** | **8** ] _text-string_：配置账号的安全口令。本命令参数配置的口令将以不可逆的加密方式生成口令密文存储，**0**表示输入明文口令，**5**表示输入MD5加密算法类型的密文口令，**8**表示输入SHA256加密算法类型的密文口令，默认为输入明文口令。
(4)　进入Line配置模式。
**line [ console | vty ] **_first-line_** [ **_last-line_** ]**
参数说明如下：
**ｏ      console**：控制台口。
ｏ      **vty**：虚终端线路，适用于Telnet或SSH连接。
ｏ      _first-line_：要进入的线路范围的起始编号。
**ｏ**      _last-line_：要进入的线路范围的最后一个编号，未选择本参数时表示只进入到_first-line_一个线路。
(5)　配置线路登录进行本地认证。
**login** **local**
缺省情况下，在AAA关闭的情况下，线路上未配置本地用户认证功能。
### （7）如何修改用户权限？
(1）修改用户级别。
ｏ    提升用户级别。
**enable **[ _privilege_-_level_ | **role** _role_-_name_ ]``
在开启RBAC功能时，使用该命令可切换当前终端的角色；若没有指定角色，默认是切换到角色Network-admin。
ｏ    降低用户级别。
**disable** [ _privilege_-_level_ ]
**disable**命令中指定的权限等级必须小于当前权限等级。
在开启RBAC功能时，无法执行本命令。
配置完成后，使用**show running-config**命令或**show privilege**可查看修改后的用户权限。
### （8）如何过滤日志信息？
日志过滤功能可以根据实际需要配置显示和记录特定类型和级别的日志信息。日志过滤需要配置的命令包含：**logging** **filter** **direction**过滤方向、**logging** **filter** **type**过滤类型和**logging filter rule**过滤规则。
l  配置过滤日志的送往方向：
ｏ     命令格式
**logging** **filter** **direction** { **all** | **buffer** | **file** | **server** | **terminal** }
ｏ     参数说明
**all**：过滤往所有方向的日志信息（包括：Console方向、VTY终端、日志缓冲区、日志文件、日志服务器）。
**buffer**：过滤往日志缓冲区的日志信息（即**show logging**命令显示出来的日志信息）。
**file**：过滤往日志文件的日志信息。
**server**：过滤往日志服务器的日志信息。
**terminal**：过滤往控制台和VTY终端（包括Telnet/SSH等）的日志信息。
l  配置过滤日志的过滤类型：
ｏ      命令格式
**logging** **filter** **type** { **contains**-**only** | **filter**-**only** }
ｏ      参数说明
**contains-only**：“只包含”，表示只输出包含了过滤规则里面的关键字信息的日志，其它没有包含过滤规则里面的日志不会输出。
**filter-only**：“只过滤”，表示将过滤掉包含了过滤规则里面的关键字信息的日志，不会输出这些过滤掉的日志信息。
l  配置日志的过滤规则：
ｏ      命令格式
```bash
logging filter rule { exact-match module module-name mnemonic mnemonic-name level inform-level | single-match { level inform-level | mnemonic mnemonic-name | module module-name } }
```
ｏ     参数说明
**exact**-**match**：精确匹配。
**mnemonic** _mnemonic-name_：要过滤的日志信息助记符名称。
**level** _inform_-_level_：要过滤的日志信息等级。取值范围为0~7。
**module** _module-name_：要过滤的模块名称。
**single**-**match**：单个匹配。
:::info
说明
●     若只配置了过滤方向和过滤类型，没有配置过滤规则，那么日志过滤功能不会生效。
●     若只配置了过滤规则，没有配置过滤方向和过滤类型，那么日志过滤功能将生效，过滤方向和过滤类型按照缺省配置生效。缺省情况下，过滤所有方向的日志信息，过滤类型为“只过滤”。
:::
下面通过两个典型配置案例来介绍日志过滤功能的配置步骤。
l  要求sys相关的日志信息不发往日志服务器，也不在控制台和VTY终端（包括Telnet/SSH等）中展示。需要配置以下日志信息过滤功能设置要求：
a　设置日志信息的过滤方向为terminal、server两个方向；
b　设置日志信息的过滤方式为“只过滤（filter-only）”；
c　设备日志信息的过滤规则为“单个匹配”，并且模块名包含 SYS 的日志信息过滤掉。
具体配置过程为：
# 进入全局配置模式。
Hostname> enable
Hostname# configure terminal
# 配置过滤方向为server和terminal。
```bash
Hostname(config)# logging filter direction server
Hostname(config)# logging filter direction terminal
```
# 配置过滤类型为“只过滤”。
`Hostname(config)# logging filter type filter-only`
# 配置过考虑规则为单个匹配模块名为SYS的日志信息。
`Hostname(config)# logging filter rule single-match module SYS`
l  由于某条日志信息显示过多影响其他日志信息查看，要求将特定某条信息过滤不显示或上传。需要配置过滤规则为精确匹配，并根据想要过滤的日志信息填入模块名称、助记词和日志等级。
ｏ      过滤日志 %**SPANTREE**-**6**-**RCVDTCBPDU**: (*2/M1) Received tc bpdu on port AggregatePort 256 on MST0
```bash
Hostname(conifg)# logging filter rule exact-match module SPANTREE mnemonic RCVDTCBPDU level 6
```
ｏ      过滤日志 %**SNMP**-**3**-**AUTHFAIL**: Authentication failure for SNMP req from host 185.94.111.1
```bash
Hostname(conifg)# logging filter rule exact-match module SNMP mnemonic AUTHFAIL level 3
```
ｏ      过滤日志 %**PARAM**-**6**-**CONFIG_SYNC**: Sync'ing the startup configuration to the standby supervisor
```bash
Hostname(conifg)# logging filter rule exact-match module SNMP mnemonic AUTHFAIL level 3
```
## 2、接口配置
### （1）光电复用接口配置
medium-type {copper | fiber}
### **（2）如何将交换机接口配置成二/三层模式？**
在接口配置模式下，通过**switchport命令** 配置接口为二层模式，通过命令**no switchport**配置接口为三层模式。
### **（3）交换机如何配置静态链路聚合接口？**
l  配置方法
您可以选择如下两种方式之一进行配置：
ｏ   在全局配置模式下，通过命令interface aggregateport ap-number创建静态聚合接口。
缺省情况下，未配置链路聚合口。
在支持AP功能的设备上配置，以太网口使用聚合功能时需要创建对应的聚合接口。
ｏ   在二层/三层以太网接口配置模式，通过命令port-group ap-number配置以太网静态聚合接口的成员接口。
缺省情况下，以太网物理口不属于任何静态链路聚合口或者LACP链路聚合口。
在支持AP功能的设备上配置。使用静态聚合功能时需要配置对应的静态聚合接口的成员接口。
警告
●     当一个接口加入AP后，该接口的属性取代为聚合接口的属性，所以一般情况下不允许在聚合接口的成员接口上进行配置，或者将配置单独生效到聚合接口的成员接口上。但少数的命令或者功能，如**shutdown**和**no shutdown**配置命令等，这些仍然可以支持在聚合接口的成员接口上配置，且配置能生效。所以用户在使用聚合接口的成员接口的时候，需要根据具体的功能要求来确定是否支持单独在聚合接口的成员接口上生效，并进行正确配置。
●     静态聚合不具备检错机制，成员接口Link Up即绑定，用户需保证拓扑正确性和成员接口之间协商属性的一致性。
l  参数说明
ap-number：链路聚合接口号。
l  配置举例
通过**port-group** _ap-number_命令创建AP 3，并将Device A上的接口GigabitEthernet 0/1和Device B上的接口GigabitEthernet 0/1加入到静态AP 3中。
ｏ   在Device A上面创建AP 3口。
```bash
DeviceA(config)# interface GigabitEthernet 0/1
DeviceA(config-if-range)# port-group 3
```
ｏ   在Device B上面创建AP 3口。
```bash
DeviceB(config)# interface GigabitEthernet 0/1
DeviceB(config-if-range)# port-group 3
```
l  配置指导
ｏ      聚合后的逻辑链路带宽是成员链路带宽的总和。
ｏ      只有物理接口才允许加入聚合接口。
ｏ      在将接口加入静态AP前，为避免震荡，需要先在此接口的配置模式中配置**shutdown**命令。待此接口和它的对端接口都加入对应的静态AP后，再执行**no shutdown**命令打开接口。
ｏ      不同介质类型或者不同接口类型的接口不允许加入同一个聚合接口。
ｏ      二层接口只能加入二层AP，三层接口只能加入三层AP。包含成员接口的聚合接口不允许改变二层/三层属性。
ｏ      对于三层设备，如果该设备不支持二层功能，聚合接口被创建时，则是三层聚合接口，否则聚合接口被创建时默认为二层聚合接口。
ｏ      接口加入AP时，该接口的属性将被所加入AP的接口属性替代。例如：AP 1口的接口速率为10Mbps，GigabitEthernet 0/1的接口速率为100Mbps，加入AP 1后，GigabitEthernet 0/1的接口速率变为10Mbps。
### **（4）交换机如何配置动态链路聚合接口（LACP）？**
在二层/三层以太网接口配置模式下，通过命令**port**-**group** _key-number_ **mode** { **active** | **passive** }配置LACP成员接口。缺省情况下，以太网物理口不属于任何LACP链路聚合口。
l  参数说明
**key-number**：LACP链路聚合口的成员接口组的编号，即LACP链路聚合口的接口号。
**Active**：表示接口会主动发起LACP聚合运算。
**Passive**：表示接口不会主动发起LACP聚合运算，但是在接收到邻居的LACP报文后会被动参与LACP计算。
l  配置举例
通过**port**-**group** _key-number_ **mode active**命令创建LACP 3，将Device A上的接口GigabitEthernet 0/1和Device B上的接口GigabitEthernet 0/1加入到LACP 3中。
ｏ   在Device A上面配置LACP。
```bash
DeviceA(config)# interface GigabitEthernet 0/1
DeviceA(config-if-range)# port-group 3 mode active
```
ｏ   在Device B上面配置LACP。
```bash
DeviceB> enable
DeviceB# configure terminal
DeviceB(config)# interface GigabitEthernet 0/1
DeviceB(config-if-range)# port-group 3 mode active
```
l  配置指导
ｏ      聚合后的逻辑链路带宽是成员链路带宽的总和。
ｏ      物理接口和链路聚合口工作在不同层次（二层或三层）的网络时，设备将不允许该物理接口加入到链路聚合口中。
ｏ      聚合接口中有支持配置port speed-mode的成员接口，聚合接口将不支持配置speed，且会自动清除聚合接口上原有的speed配置，聚合接口的配置速率会切换为成员接口port speed-mode配置的速率。
### **（5）如何查看链路聚合口的负载均衡方式？**
show aggregateport load-balance
### **（6）如何在交换机端口上配置连接无线AP？**
交换机连接无线AP时，在交换机端口上的配置如下：
(1) 在二层以太网/聚合接口配置模式下，通过命令**switchport** **mode** **trunk**将与无线AP连接的接口配置为Trunk口。缺省情况下，二层接口的模式为Access。
(2) 在二层以太网/聚合接口配置模式下，通过命令**switchport** **trunk** **native** **vlan** _vlan-id_配置Trunk口的Native VLAN。缺省情况下，Trunk口不存在Native VLAN。
ｏ   参数说明
vlan-id：指定Native VLAN ID，只能配置单个VLAN。在交换机配置连接无线AP时，需要指定Native VLAN为无线AP的VLAN。
ｏ   配置指导
配置二层接口的模式前，需要确保接口为二层模式。通过**show interface** **[ _interface-type interface-number_ ] switchport**命令可查看接口当前模式；若接口对应的Switchport字段为“enabled”，表示该接口为二层接口；若接口对应的Switchport字段为“disabled”，表示该接口为三层接口，应当先使用**switchport**命令将其配置为二层接口。
# 查看接口当前模式
```bash
Hostname> enable
Hostname# show interface aggregateport 1 switchport
Interface　　　　　　　　　　　　**Switchport** Mode　　　Access Native Protected VLAN lists
- ------------------------------- ---------- --------- ------ ------ --------- -----------

AggregatePort 1　　　　　　　　　**enabled**　　TRUNK　　 1　　　1　　　Disabled　ALL
```
Trunk口发送Native VLAN的报文不携带Tag；当接口收到不携带Tag的报文认为报文属于其Native VLAN。
l  配置举例
# 若无线AP的VLAN为VLAN 10，配置二层以太网接口为Trunk口，配置Native VLAN为VLAN 10。
```bash
Hostname(config)# interface gigabitethernet 0/1
Hostname(config-if-GigabitEthernet 0/1)# switchport mode trunk
Hostname(config-if-GigabitEthernet 0/1)# switch trunk native vlan 10
```
## 3、以太网交换
### **（1）如何查看交换机的邻居设备信息？**
show lldp neighbors [ interface interface-type interface-number ] [ detail | enhance ]
### （2）如何创建VLAN？
在全局配置模式下，通过vlan { vlan-id | range vlan-range }命令创建普通静态VLAN，进入 VLAN配置模式。 vlan-range可以包含一个或多个VLAN，当配置多个VLAN时，VLAN ID间用逗号隔开，连续的 VLAN ID还可使用“－”头尾连接，无大小顺序要求。
### **（3）如何配置不同VLAN间进行通信？**
在实际使用VLAN的场景中，不同VLAN的设备间可能存在通信需求。尽管VLAN广播域是二层隔离的，不同VLAN的设备之间仍可以通过三层设备来进行通信，但此方式需占用路由接口。通过在二层交换设备的基础上增加路由模块构成三层交换设备，可以解决此问题。下面通过一个典型配置举例来说明如何通过三层交换设备实现不同VLAN间的通信。
**组网需求**
某用户内网存在三个部门，相互之间需要二层隔离，三层互联。
因此分别在3台接入设备Device A、Device B和Device C上创建VLAN，用户内网被划分为VLAN 10、VLAN 20和VLAN 30，相互之间二层隔离。把接口定义为一个VLAN的成员，所有连接到此接口的终端都是VLAN网络的一部分。调整用户所在VLAN，只需要调整接口的VLAN配置，而不必调整物理位置。
在核心设备Device D上配置3个VLAN，配置连接Device A、B和C的接口为Trunk口，并指定许可VLAN列表。配置3个SVI，分别作为3个VLAN对应IP子网的网关接口，3个VLAN对应的IP子网分别为192.168.10.0/24、192.168.20.0/24和192.168.30.0/24，3个VLAN通过三层核心设备的IP转发能力实现子网互连。
**组网图**
**图4-2 VLAN典型应用场景配置组网图**
![image.png](https://cdn.nlark.com/yuque/0/2023/png/35951150/1684074713953-6b0306ca-96f0-4ba0-9189-ea4a5c48022c.png#averageHue=%23070504&clientId=u1da44472-2496-4&from=paste&id=u462c3681&originHeight=410&originWidth=726&originalType=url&ratio=1&rotation=0&showTitle=false&size=100226&status=done&style=none&taskId=ua21aff29-d69d-4fb1-ab38-7f708c63481&title=)
**配置要点**
l  在三层核心设备Device D上配置3个VLAN，配置连接Device A、B和C的接口为Trunk口，并配置许可VLAN列表，实现二层隔离。
l  在Device D配置3个SVI口，分别作为3个VLAN对应IP子网的网关接口，配置网关IP地址。在终端上根据所在网段，配置默认网关地址。
l  分别在3台接入设备Device A、B和C上创建VLAN，为各VLAN分配Access口，配置连接Device D的接口为Trunk口。
**配置步骤**
(1) 创建和配置VLAN。
# 在核心设备Device D上创建VLAN。修改VLAN 10的名称。
```bash
DeviceD(config)# vlan 10
DeviceD(config-vlan)# name office
DeviceD(config-vlan)# vlan range 20,30
DeviceD(config-vlan-range)# exit
```
# 在接入设备Device A上创建VLAN。
```bash
DeviceA(config)# vlan range 10,20
DeviceA(config-vlan-range)# exit
```
# 在接入设备Device B上创建VLAN。
```bash
DeviceB(config)# vlan range 10,20,30
DeviceB(config-vlan-range)# exit
```
# 在接入设备Device C上创建VLAN。
```bash
DeviceC(config)# vlan range 20,30
DeviceC(config-vlan-range)# exit
```
(2) 在Device D上配置VLAN三层SVI口的IP地址。
```bash
DeviceD(config)# interface vlan 10
DeviceD(config-if-VLAN 10)# ip address 192.168.10.1 255.255.255.0
DeviceD(config-if-VLAN 10)# exit
DeviceD(config)# interface vlan 20
DeviceD(config-if-VLAN 20)# ip address 192.168.20.1 255.255.255.0
DeviceD(config-if-VLAN 20)# exit
DeviceD(config)# interface vlan 30
DeviceD(config-if-VLAN 30)# ip address 192.168.30.1 255.255.255.0
DeviceD(config-if-VLAN 30)# exit
```
(3) 配置Device D的下联口为Trunk口，分别配置其许可VLAN范围。
```bash
DeviceD(config)# interface range gigabitethernet 0/2-4
DeviceD(config-if-range)# switchport
DeviceD(config-if-range)# switchport mode trunk
DeviceD(config-if-range)# exit
DeviceD(config)# interface gigabitethernet 0/2
DeviceD(config-if-GigabitEthernet 0/2)# switchport trunk native vlan 1
DeviceD(config-if-GigabitEthernet 0/2)# switchport trunk allowed vlan only 10,20
DeviceD(config-if-GigabitEthernet 0/2)# exit
DeviceD(config)# interface gigabitethernet 0/3
DeviceD(config-if-GigabitEthernet 0/3)# switchport trunk native vlan 1
DeviceD(config-if-GigabitEthernet 0/3)# switchport trunk allowed vlan only 10,20,30
DeviceD(config-if-GigabitEthernet 0/3)# exit
DeviceD(config-if)# interface gigabitethernet 0/4
DeviceD(config-if-GigabitEthernet 0/4)# switchport trunk native vlan 1
DeviceD(config-if-GigabitEthernet 0/4)# switchport trunk allowed vlan only 20,30
DeviceD(config-if-GigabitEthernet 0/4)# end
DeviceD# write
```
(4) 配置接入设备上联口为Trunk口，配置其许可VLAN范围。如下以Device A配置为例，B和C配置类似。
# 配置Device A的上联口为Trunk模式。许可所有VLAN的数据通过。
```bash
DeviceA(config)# interface gigabitethernet 0/1
DeviceA(config-if-GigabitEthernet 0/1)# switchport
DeviceA(config-if-GigabitEthernet 0/1)# switchport mode trunk
DeviceA(config-if-GigabitEthernet 0/1)# switchport trunk native vlan 1
DeviceA(config-if-GigabitEthernet 0/1)# switchport trunk allowed vlan all
DeviceA(config-if-GigabitEthernet 0/1)# exit
```
(5) 配置接入设备下联口为Access口，并加入指定VLAN。如下以Device A配置为例，B和C配置类似。
# 配置Device A的下联口为Access模式，分别加入不同的VLAN。
```bash
DeviceA(config)# interface range gigabitethernet 0/2-12
DeviceA(config-if-range)# switchport
DeviceA(config-if-range)# switchport mode access
DeviceA(config-if-range)# switchport access vlan 10
DeviceA(config-if-range)# interface range gigabitethernet 0/13-24
DeviceA(config-if-range)# switchport
DeviceA(config-if-range)# switchport mode access
DeviceA(config-if-range)# switchport access vlan 20
DeviceA(config-if-range)# end
DeviceA# write
```
**验证配置结果**
(1) 在Device D上，使用**show vlan** [ **id** _vlan_-_id_ ]命令查看VLAN信息，包括VLAN ID、名称、状态和加入接口。
```bash
DeviceD# show vlan

VLAN　Name　　　 Status　　　　　　　　Ports

- --- --------　-------- -------------------------------

1 VLAN0001　 STATIC　　 Gi0/1, Gi0/5, Gi0/6, Gi0/7

Gi0/8, Gi0/9, Gi0/10, Gi0/11

Gi0/12, Gi0/13, Gi0/14, Gi0/15

Gi0/16, Gi0/17, Gi0/18, Gi0/19

Gi0/20, Gi0/21, Gi0/22, Gi0/23

Gi0/24

10 office　　STATIC　　　Gi0/2, Gi0/3

20 VLAN0020　STATIC　　　Gi0/2, Gi0/3, Gi0/4

30 VLAN0030　STATIC　　　Gi0/3, Gi0/4
```
(2) 查看接口配置和状态是否正确。
# 在Device D上，使用**show interface switchport**命令查看接口的VLAN状态。
```bash
DeviceD# show interface switchport

Interface　　　　　　　　　　　　Switchport Mode　　　Access Native Protected VLAN lists

- ------------------------------- ---------- --------- ------ ------ --------- --

GigabitEthernet 0/2　　　　　　　enabled　　TRUNK　　　　　　1　　　Disabled　10,20

GigabitEthernet 0/3　　　　　　　enabled　　TRUNK　　　　　　1　　　Disabled　10,20,30

GigabitEthernet 0/4　　　　　　　enabled　　TRUNK　　　　　　1　　　Disabled　20,30
```
# 在Device D上，使用**show interface description**命令查看接口状态为up。
```c
DeviceD# show interface description

Interface　　　　　　　　　　　　　　　　Status　 Administrative Description

- --------------------------------------- -------- -------------- -----------

GigabitEthernet 0/2　　　　　　　　　　　up　　　 up

GigabitEthernet 0/3　　　　　　　　　　　up　　　 up

GigabitEthernet 0/4　　　　　　　　　　　up　　　 up

VLAN 10　　　　　　　　　　　　　　　　　up　　　 up

VLAN 20　　　　　　　　　　　　　　　　　up　　　 up

VLAN 30　　　　　　　　　　　　　　　　　up　　　 up
```
(3) 在Device D上，使用**show ip route**命令查看SVI的直连路由是否正确。
# 目的IP匹配192.168.10.0/24的报文，向VLAN 10转发；目的IP匹配192.168.20.0/24的报文，向VLAN 20转发；目的IP匹配192.168.30.0/24的报文，向VLAN 30转发。
```c
DeviceD# show ip route

Codes:　C - Connected, L - Local, S - Static

R - RIP, O - OSPF, B - BGP, I - IS-IS, V - Overflow route

N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2

E1 - OSPF external type 1, E2 - OSPF external type 2

SU - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2

IA - Inter area, EV - BGP EVPN, A - Arp to host

LA - Local aggregate route

* - candidate default

Gateway of last resort is no set

…

C　　 192.168.10.0/24 is directly connected, VLAN 10

C　　 192.168.10.1/32 is local host.

C　　 192.168.20.0/24 is directly connected, VLAN 20

C　　 192.168.20.1/32 is local host.

C　　 192.168.30.0/24 is directly connected, VLAN 30

C　　 192.168.30.1/32 is local host.
```
# 在Device D上可以Ping通VLAN（例如VLAN 10）的SVI地址。
```c
DeviceD# ping 192.168.10.1

Sending 5, 100-byte ICMP Echoes to 192.168.10.1, timeout is 2 seconds:

< press Ctrl+C to break >

!!!!!

Success rate is 100 percent (5/5), round-trip min/avg/max = 1/1/1 ms.
```
(4) 以终端Host 2、Host 12和Host 13为例，验证连通性。
# 配置VLAN 10内Host 2的缺省网关为192.168.10.1，接口IP地址为192.168.10.2，掩码255.255.255.0。
```c
Host2> enable

Host2# configure terminal

Host2(config)# ip route 0.0.0.0 0.0.0.0 192.168.10.1

Host2(config)# interface gigabitethernet 0/1

Host2(config-if-GigabitEthernet 0/1)# no switchport

Host2(config-if-GigabitEthernet 0/1)# ip address 192.168.10.2 255.255.255.0
```
# 配置VLAN 10内Host 12的缺省网关为192.168.10.1，接口IP地址为192.168.10.12，掩码255.255.255.0。
# 配置VLAN 20内Host 13的缺省网关为192.168.20.1，接口IP地址为192.168.20.13，掩码255.255.255.0。
# 在终端上使用**show ip route**命令查看缺省网关。发送端和接收端都需要配置缺省网关，任何一方未配置都无法实现跨网段通信。以Host 2为例，因存在缺省路由S*0.0.0.0/0 [1/0] via 192.168.10.1，当终端需要跨网段通信时，将报文交由网关192.168.10.1转发。
```bash
Host2# show ip route

Codes:　C - Connected, L - Local, S - Static

R - RIP, O - OSPF, B - BGP, I - IS-IS, V - Overflow route

N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2

E1 - OSPF external type 1, E2 - OSPF external type 2

SU - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2

IA - Inter area, EV - BGP EVPN, A - Arp to host

LA - Local aggregate route

* - candidate default

Gateway of last resort is 192.168.10.1 to network 0.0.0.0

S*　　0.0.0.0/0 [1/0] via 192.168.10.1

C　　 192.168.10.0/24 is directly connected, GigabitEthernet 0/1

C　　 192.168.10.2/32 is local host.
```
# 在DeviceD上可以Ping通终端（例如Host 2）的IP地址。
```bash
DeviceD# ping 192.168.10.2

Sending 5, 100-byte ICMP Echoes to 192.168.10.2, timeout is 2 seconds:

< press Ctrl+C to break >

!!!!!

Success rate is 100 percent (5/5), round-trip min/avg/max = 2/3/4 ms.
```
# 同VLAN（例如VLAN 10）内的终端能够互相Ping通。
```bash
Host2# ping 192.168.10.12

Sending 5, 100-byte ICMP Echoes to 192.168.10.12, timeout is 2 seconds:

< press Ctrl+C to break >

!!!!!

Success rate is 100 percent (5/5), round-trip min/avg/max = 2/2/3 ms.
```
# 不同VLAN内的终端也可以互相Ping通。但若在Device D上删除SVI的IP地址配置，或在终端上删除缺省网关，不同VLAN内的终端则无法Ping通。
### **（4）如何配置Trunk口只允许指定VLAN的流量通过？**
在二层以太网接口配置模式/二层聚合接口配置模式下，通过**switchport trunk** **allowed vlan** { **add** _vlan-list_ | **except** _vlan-list_ | **only** _vlan-list_ | **remove** _vlan-list_ }命令配置Trunk口只允许指定VLAN的流量通过。
# 配置二层以太网接口为Trunk口，并增加VLAN 2到许可VLAN中。
```bash
Hostname(config)# interface gigabitethernet 0/1
Hostname(config-if-GigabitEthernet 0/1)# switchport mode trunk
Hostname(config-if-GigabitEthernet 0/1)# switchport trunk allowed vlan add 2
```
# 配置二层以太网接口为Trunk口，并从其许可VLAN中移除VLAN 2。
```bash
Hostname(config)# interface gigabitethernet 0/1
Hostname(config-if-GigabitEthernet 0/1)# switchport mode trunk
Hostname(config-if-GigabitEthernet 0/1)# switchport trunk allowed vlan remove 2
```
# 配置二层以太网接口为Trunk口，增加除了VLAN 10以外的其它VLAN到许可VLAN中。
```bash
Hostname(config)# interface gigabitethernet 0/1
Hostname(config-if-GigabitEthernet 0/1)# switchport mode trunk
Hostname(config-if-GigabitEthernet 0/1)# switchport trunk allowed vlan except 10
```
# 配置二层以太网接口为Trunk口，只许可VLAN 10通过，其它VLAN从其许可VLAN中移除。
```bash
Hostname(config)# interface gigabitethernet 0/1
Hostname(config-if-GigabitEthernet 0/1)# switchport mode trunk
Hostname(config-if-GigabitEthernet 0/1)# switchport trunk allowed vlan only 10
```
### **（5）交换机如何配置生成树功能进行防环、破环？**
生成树协议是一种二层管理协议，它的主要功能是阻塞网络中的冗余链路来消除二层环路，在链路故障时启用备份链路。下面通过一个典型配置举例来介绍如何通过配置生成树功能进行防环、破环。
**组网需求**
如[图4-3](https://www.ruijie.com.cn/Fu/Article/bd3415c1-9d5b-4d02-8c84-7122bb99f852/%E5%AE%98%E7%BD%91%E5%8F%91%E5%B8%83/HTML/00-html/4.17-%E4%BA%A4%E6%8D%A2%E6%9C%BA%E5%A6%82%E4%BD%95%E9%85%8D%E7%BD%AE%E7%94%9F%E6%88%90%E6%A0%91%E5%8A%9F%E8%83%BD%E8%BF%9B%E8%A1%8C%E9%98%B2%E7%8E%AF%E3%80%81%E7%A0%B4%E7%8E%AF.html#_Ref71359810)的两层拓扑结构，核心层设备为Device A和Device B，接入层设备为Device C，Device C连接内网终端。内网存在4个VLAN，配置MSTP功能满足如下需求：
l  VLAN 10和VLAN 30的生成树根桥为Device A，并且从Device C的GigabitEthernet 0/1转发数据。
l  VLAN 20和VLAN 40的生成树根桥为Device B，并且从Device C的GigabitEthernet 0/2转发数据。
l  在Device C的根端口上开启环路保护功能。在Device C连接终端的边缘端口上开启BPDU保护功能。
**组网图**
**图4-3 MSTP基本配置组网图**
![image.png](https://cdn.nlark.com/yuque/0/2023/png/35951150/1684074714019-373bca43-68e9-4ccf-8904-308dfa19a970.png#averageHue=%23050504&clientId=u1da44472-2496-4&from=paste&id=ueac28b46&originHeight=541&originWidth=854&originalType=url&ratio=1&rotation=0&showTitle=false&size=177801&status=done&style=none&taskId=ub55961e0-6338-4230-82b2-1b1efb1f54e&title=)
**配置要点**
l  在Devcie A、B和C上创建相同的VLAN，配置相同的实例映射：实例1映射VLAN 10和30；实例2映射VLAN 20和40。实例0包含其它未创建的VLAN。
l  设备通过比较优先级向量< Root Identifier，Root Path Cost，Bridge ID，Port ID >选举出生成树中的设备角色和端口角色，配置实例的桥优先级和端口路径开销，以便算出组网需求中要求的拓扑。为便于管理，实例0配置和实例1同样的生成树。
实例0和1：
ｏ   Device A的桥优先级配置为4096，Device B的桥优先级配置为8192，Device C的桥优先级采用缺省值32768（无需配置），使Device A成为根。
ｏ   在Device B上，配置GigabitEthernet 0/2端口路径开销为1，GigabitEthernet 0/1端口路径开销为4，使得GigabitEthernet 0/2成为Device B的根端口。
ｏ   在Device C上，配置GigabitEthernet 0/1端口路径开销为1，GigabitEthernet 0/2端口路径开销为4，使得GigabitEthernet 0/1成为Device C的根端口。
ｏ   Device B的桥优先级8192高于Device C的桥优先级32768，Device B的GigabitEthernet 0/1成为指定端口，Device C的GigabitEthernet 0/2成为替换端口。
实例2：
ｏ   Device B的桥优先级配置为4096，Device A的桥优先级配置为8192，Device C的桥优先级采用缺省值32768（无需配置），使Device B成为根。
ｏ   在Device A上，配置GigabitEthernet 0/2端口路径开销为1，GigabitEthernet 0/1端口路径开销为4，使得GigabitEthernet 0/2成为Device A的根端口。
ｏ   在Device C上，配置GigabitEthernet 0/2端口路径开销为1，GigabitEthernet 0/1端口路径开销为4，使得GigabitEthernet 0/2成为Device C的根端口。
ｏ   Device A的桥优先级8192高于Device C的桥优先级32768，Device A的GigabitEthernet 0/1成为指定端口，Device C的GigabitEthernet 0/1成为替换端口。
l  在Device C的GigabitEthernet 0/1~0/2上配置MSTP环路保护，当根端口或备份口因收不到BPDU迁移为指定端口时，端口状态将一直保持Discarding（废弃）状态，直到重新收到BPDU进行生成树计算。
l  配置Device C连接终端的接口GigabitEthernet 0/3~0/6为边缘端口。在缺省情况下边缘端口自动识别功能处于开启状态，若GigabitEthernet 0/3~0/6被选举为指定端口后3秒内未接收到BPDU，则被自动识别为边缘端口并立即进入转发状态。若网络中存在丢包或收发报文延迟的现象，可能影响边缘端口自动识别功能。因此，关闭边缘端口自动识别功能，手工配置其为边缘端口，并开启BPDU保护功能。
l  在Devcie A、B和C上全局开启生成树功能，缺省为MSTP模式。
l  配置Devcie A、B和C的互联端口为Trunk口，许可所有VLAN通过。配置Device C连接终端的接口加入所在VLAN。
**配置步骤**
(1) 配置Device A。
# 创建VLAN，配置实例映射。
```bash
DeviceA(config)# vlan range 10,20,30,40
DeviceA(config-vlan-range)# exit
DeviceA(config)# spanning-tree mst configuration
DeviceA(config-mst)# instance 1 vlan 10,30
DeviceA(config-mst)# instance 2 vlan 20,40
```
# 配置实例0和1的桥优先级为4094，实例2的桥优先级为8192。
```bash
DeviceA(config-mst)# spanning-tree mst 0 priority 4096
DeviceA(config)# spanning-tree mst configuration
DeviceA(config-mst)# spanning-tree mst 1 priority 4096
DeviceA(config)# spanning-tree mst configuration
DeviceA(config-mst)# spanning-tree mst 2 priority 8192
```
# 配置GigabitEthernet 0/2为Trunk口。在实例2中，配置端口路径开销为1。
```bash
DeviceA(config)# interface gigabitethernet 0/2
DeviceA(config-if-GigabitEthernet 0/2)# switchport
DeviceA(config-if-GigabitEthernet 0/2)# switchport mode trunk
DeviceA(config-if-GigabitEthernet 0/2)# switchport trunk native vlan 1
DeviceA(config-if-GigabitEthernet 0/2)# switchport trunk allowed vlan all
DeviceA(config-if-GigabitEthernet 0/2)# spanning-tree mst 2 cost 1
DeviceA(config-if-GigabitEthernet 0/2)# exit
```
# 配置GigabitEthernet 0/1为Trunk口。在实例2中，配置端口路径开销为4。
```bash
DeviceA(config)# interface gigabitethernet 0/1
DeviceA(config-if-GigabitEthernet 0/1)# switchport
DeviceA(config-if-GigabitEthernet 0/1)# switchport mode trunk
DeviceA(config-if-GigabitEthernet 0/1)# switchport trunk native vlan 1
DeviceA(config-if-GigabitEthernet 0/1)# switchport trunk allowed vlan all
DeviceA(config-if-GigabitEthernet 0/1)# spanning-tree mst 2 cost 4
DeviceA(config-if-GigabitEthernet 0/1)# exit
```
# 全局开启生成树功能。
```bash
DeviceA(config)# spanning-tree
DeviceA(config)# end
DeviceA# write
```
(2) 配置Device B。
# 创建VLAN，配置实例映射。
```bash
DeviceB(config)# vlan range 10,20,30,40
DeviceB(config-vlan-range)# exit
DeviceB(config)# spanning-tree mst configuration
DeviceB(config-mst)# instance 1 vlan 10,30
DeviceB(config-mst)# instance 2 vlan 20,40
```
# 配置实例2的优先级为4094，实例0和1的桥优先级为8192。
```bash
DeviceB(config-mst)# spanning-tree mst 0 priority 8192
DeviceB(config)# spanning-tree mst configuration
DeviceB(config-mst)# spanning-tree mst 1 priority 8192
DeviceB(config)# spanning-tree mst configuration
DeviceB(config-mst)# spanning-tree mst 2 priority 4096
```
# 配置GigabitEthernet 0/2为Trunk口。在实例0和1中，配置端口路径开销为1。
```bash
DeviceB(config)# interface gigabitethernet 0/2
DeviceB(config-if-GigabitEthernet 0/2)# switchport
DeviceB(config-if-GigabitEthernet 0/2)# switchport mode trunk
DeviceB(config-if-GigabitEthernet 0/2)# switchport trunk native vlan 1
DeviceB(config-if-GigabitEthernet 0/2)# switchport trunk allowed vlan all
DeviceB(config-if-GigabitEthernet 0/2)# spanning-tree mst 0 cost 1
DeviceB(config-if-GigabitEthernet 0/2)# spanning-tree mst 1 cost 1
DeviceB(config-if-GigabitEthernet 0/2)# exit
```
# 配置GigabitEthernet 0/1为Trunk口。在实例0和1中，配置端口路径开销为4。
```bash
DeviceB(config)# interface gigabitethernet 0/1
DeviceB(config-if-GigabitEthernet 0/1)# switchport
DeviceB(config-if-GigabitEthernet 0/1)# switchport mode trunk
DeviceB(config-if-GigabitEthernet 0/1)# switchport trunk native vlan 1
DeviceB(config-if-GigabitEthernet 0/1)# switchport trunk allowed vlan all
DeviceB(config-if-GigabitEthernet 0/1)# spanning-tree mst 0 cost 4
DeviceB(config-if-GigabitEthernet 0/1)# spanning-tree mst 1 cost 4
DeviceB(config-if-GigabitEthernet 0/1)# exit
```
# 全局开启生成树功能。
```bash
DeviceB(config)# spanning-tree
DeviceB(config)# end
DeviceB# write
```
(3) 配置Device C。
# 创建VLAN，配置实例映射。
```bash
DeviceC(config)# vlan range 10,20,30,40
DeviceC(config-vlan-range)# exit
DeviceC(config)# spanning-tree mst configuration
DeviceC(config-mst)# instance 1 vlan 10,30
DeviceC(config-mst)# instance 2 vlan 20,40
DeviceC(config-mst)# exit
```
# 配置上联口GigabitEthernet 0/1为Trunk口。在实例0和1中配置端口路径开销为1，在实例2中配置端口路径开销为4。配置端口环路保护。
```bash
DeviceC(config)# interface gigabitethernet 0/1
DeviceC(config-if-GigabitEthernet 0/1)# switchport
DeviceC(config-if-GigabitEthernet 0/1)# switchport mode trunk
DeviceC(config-if-GigabitEthernet 0/1)# switchport trunk native vlan 1
DeviceC(config-if-GigabitEthernet 0/1)# switchport trunk allowed vlan all
DeviceC(config-if-GigabitEthernet 0/1)# spanning-tree mst 0 cost 1
DeviceC(config-if-GigabitEthernet 0/1)# spanning-tree mst 1 cost 1
DeviceC(config-if-GigabitEthernet 0/1)# spanning-tree mst 2 cost 4
DeviceC(config-if-GigabitEthernet 0/1)# spanning-tree guard loop
DeviceC(config-if-GigabitEthernet 0/1)# exit
```
# 配置上联口GigabitEthernet 0/2为Trunk口。在实例2中配置端口路径开销为1，在实例0和1中配置端口路径开销为4。配置端口环路保护。
```bash
DeviceC(config)# interface gigabitethernet 0/2
DeviceC(config-if-GigabitEthernet 0/2)# switchport
DeviceC(config-if-GigabitEthernet 0/2)# switchport mode trunk
DeviceC(config-if-GigabitEthernet 0/2)# switchport trunk native vlan 1
DeviceC(config-if-GigabitEthernet 0/2)# switchport trunk allowed vlan all
DeviceC(config-if-GigabitEthernet 0/2)# spanning-tree mst 0 cost 4
DeviceC(config-if-GigabitEthernet 0/2)# spanning-tree mst 1 cost 4
DeviceC(config-if-GigabitEthernet 0/2)# spanning-tree mst 2 cost 1
DeviceC(config-if-GigabitEthernet 0/2)# spanning-tree guard loop
DeviceC(config-if-GigabitEthernet 0/2)# exit
```
# 配置下联口GigabitEthernet 0/3~0/6加入指定VLAN。配置接口为边缘端口，配置BPDU保护功能。
```bash
DeviceC(config)# interface gigabitethernet 0/3
DeviceC(config-if-GigabitEthernet 0/3)# switchport
DeviceC(config-if-GigabitEthernet 0/3)# switchport mode access
DeviceC(config-if-GigabitEthernet 0/3)# switchport access vlan 10
DeviceC(config-if-GigabitEthernet 0/3)# spanning-tree autoedge disabled
DeviceC(config-if-GigabitEthernet 0/3)# spanning-tree portfast
DeviceC(config-if-GigabitEthernet 0/3)# spanning-tree bpduguard enable
DeviceC(config-if-GigabitEthernet 0/3)# exit

DeviceC(config)# interface gigabitethernet 0/4
DeviceC(config-if-GigabitEthernet 0/4)# switchport
DeviceC(config-if-GigabitEthernet 0/4)# switchport mode access
DeviceC(config-if-GigabitEthernet 0/4)# switchport access vlan 20
DeviceC(config-if-GigabitEthernet 0/4)# spanning-tree autoedge disabled
DeviceC(config-if-GigabitEthernet 0/4)# spanning-tree portfast
DeviceC(config-if-GigabitEthernet 0/4)# spanning-tree bpduguard enable
DeviceC(config-if-GigabitEthernet 0/4)# exit

DeviceC(config)# interface gigabitethernet 0/5
DeviceC(config-if-GigabitEthernet 0/5)# switchport
DeviceC(config-if-GigabitEthernet 0/5)# switchport mode access
DeviceC(config-if-GigabitEthernet 0/5)# switchport access vlan 30
DeviceC(config-if-GigabitEthernet 0/5)# spanning-tree autoedge disabled
DeviceC(config-if-GigabitEthernet 0/5)# spanning-tree portfast
DeviceC(config-if-GigabitEthernet 0/5)# spanning-tree bpduguard enable
DeviceC(config-if-GigabitEthernet 0/5)# exit

DeviceC(config)# interface gigabitethernet 0/6
DeviceC(config-if-GigabitEthernet 0/6)# switchport
DeviceC(config-if-GigabitEthernet 0/6)# switchport mode access
DeviceC(config-if-GigabitEthernet 0/6)# switchport access vlan 40
DeviceC(config-if-GigabitEthernet 0/6)# spanning-tree autoedge disabled
DeviceC(config-if-GigabitEthernet 0/6)# spanning-tree portfast
DeviceC(config-if-GigabitEthernet 0/6)# spanning-tree bpduguard enable
DeviceC(config-if-GigabitEthernet 0/6)# exit
```
# 全局开启生成树功能。
```bash
DeviceC(config)# spanning-tree
DeviceC(config)# end
DeviceC# write
```
### **（6）如何查看MAC地址是从哪个接口上学习到的？**
show mac-address-table address mac-address
## 4、IP业务
show arp mac-address //**通过MAC地址查询对应IP地址**
show arp ip-address //**看一个IP地址是从哪个接口学习到的**
### **（1）如何配置静态ARP表项？**
在全局配置模式下，通过**arp** _ipv4-address mac-address arp-type_命令可以配置静态ARP映射记录，手工指定IP地址和MAC地址的映射。
# 为以太网上的主机配置静态ARP映射记录，IP地址为1.1.1.1，MAC地址为4e54.3800.0002。
```bash
Hostname# configure terminal
Hostname(config)# arp 1.1.1.1 4e54.3800.0002 arpa
```
### **（2）如何配置DHCP功能？**
DHCP，Dynamic Host Configuration Protocal，动态主机配置协议，广泛用于为接入网络的主机自动分配IP地址和子网掩码，能有效避免局域网内IP地址冲突导致的网络通信异常。配置DHCP功能需要在全局配置模式下先创建DHCP地址池并进入DHCP地址池配置模式，然后配置地址池属性，如指定地址租期、域名服务器地址以及自定义选项等信息。
下面通过一个典型配置案例来说明DHCP服务器配置步骤。
l  组网图
![image.png](https://cdn.nlark.com/yuque/0/2023/png/35951150/1684079315805-577d562a-944b-485a-a3f2-93de9262dd3b.png#averageHue=%23927140&clientId=u1da44472-2496-4&from=paste&id=uf518bfb1&originHeight=361&originWidth=535&originalType=url&ratio=1&rotation=0&showTitle=false&size=44492&status=done&style=none&taskId=u5845519b-1bfc-4002-8866-c36b750007c&title=)
l  配置需求
Device A配置为DHCP服务器，分别创建192.1.1.0/25网段地址池和192.1.1.128/25网段地址池，同时配置DNS服务器地址为192.1.1.130/25。
l  配置过程
# 配置接口的IP地址。
```bash
DeviceA(config)# interface gigabitethernet 0/1
DeviceA(config-if-GigabitEthernet 0/1)# ip address 192.1.1.1 255.255.255.128
DeviceA(config-if-GigabitEthernet 0/1)# exit

DeviceA(config)# interface gigabitethernet 0/2
DeviceA(config-if-GigabitEthernet 0/2)# ip address 192.1.1.129 255.255.255.128
DeviceA(config-if-GigabitEthernet 0/2)# exit
```
# 启用DHCP Server服务。
DeviceA(config)# service dhcp
# 配置地址池pool1的网络参数。
```bash
DeviceA(config)# ip dhcp pool pool1
DeviceA(dhcp-config)# network 192.1.1.0 255.255.255.128
```
# 配置DHCP服务器为用户分配的缺省网关。
DeviceA(dhcp-config)# default-router 192.1.1.1
# 配置DHCP服务器为用户分配的DNS服务器。
DeviceA(dhcp-config)# dns-server 192.1.1.130
# 配置DHCP服务器为用户分配的后缀域名。
DeviceA(dhcp-config)# domain-name test.com
# 配置DHCP服务器分配给客户端地址的租期时间。
```bash
DeviceA(dhcp-config)# lease 5
DeviceA(dhcp-config)# exit
```
# 配置地址池pool2的网络参数，配置步骤与pool1类似。
```bash
DeviceA(config)# ip dhcp pool pool2
DeviceA(dhcp-config)# network 192.1.1.128 255.255.255.128
DeviceA(dhcp-config)# default-router 192.1.1.129
DeviceA(dhcp-config)# dns-server 192.1.1.130
DeviceA(dhcp-config)# domain-name test.com
DeviceA(dhcp-config)# lease 3
```
# 查看配置结果。
```bash
DeviceA(config)# show running-config | include dhcp
ip dhcp pool pool1
network 192.1.1.0 255.255.255.128
default-router 192.1.1.1
dns-server 192.1.1.130
domain-name test.com
lease 5
ip dhcp pool pool2
network 192.1.1.128 255.255.255.128
default-router 192.1.1.129
dns-server 192.1.1.130
domain-name test.com
lease 3
```
### **（3）如何配置DHCP服务器静态绑定地址？**
在全局配置模式下通过**ip dhcp pool**创建静态DHCP地址池，然后通过**host** _ipv4-address_ [ _mask_ ]命令和**hardware-address** _hardware-address_命令配置静态绑定客户端相关参数即可。例如，为MAC地址为0050.56b0.2f50的DHCP客户端配置固定的IP地址192.1.1.99/24，需要在DHCP服务器上进行如下配置：
# 进入全局配置模式。
# 开启DHCP Server服务。
Hostname(config)# service dhcp
# 创建地址池pool1。
Hostname(config)# ip dhcp pool pool1
# 配置采用静态绑定方式为客户端Host分配IP地址。
```bash
Hostname(dhcp-config)# host 192.1.1.99 255.255.255.0
Hostname(dhcp-config)# hardware-address 0050.56b0.2f50
```
### **（4）如何配置DHCP排除地址功能？**
Hostname(config)# ip dhcp excluded-address 192.168.1.1 192.168.1.50
show ip dhcp pool //查看DHCP服务器地址池分配情况
### **（5）如何配置DHCP中继（DHCP Relay）功能？**
配置DHCP中继功能首先需要在全局配置模式下通过**service dhcp**命令开启DHCP中继功能，然后通过**ip helper-address** _ipv4-address_命令添加DHCP服务器地址。下面通过一个典型配置案例来说明配置步骤。
l  组网图
![image.png](https://cdn.nlark.com/yuque/0/2023/png/35951150/1684079315724-ca9518a6-c5af-4529-8957-e1c302753b0e.png#averageHue=%237b5e34&clientId=u1da44472-2496-4&from=paste&id=u6d4b628a&originHeight=204&originWidth=729&originalType=url&ratio=1&rotation=0&showTitle=false&size=43936&status=done&style=none&taskId=u924486c8-edaf-4b65-8462-6187e077ecb&title=)
l  组网需求
DHCP客户端Host所在网段为192.1.1.0/24，Device A为网关设备，Device B为DHCP服务器。DHCP客户端要想向DHCP服务器申请到IP地址等相关配置信息，需要将网关作为DHCP中继，使得DHCP报文能够被中继转发给DHCP服务器。
l  配置步骤
(1) 配置Device A
# 配置接口的IP地址。
```bash
DeviceA(config)# interface gigabitethernet 0/1
DeviceA(config-if-GigabitEthernet 0/1)# ip address 192.1.1.1 255.255.255.0
DeviceA(config-if-GigabitEthernet 0/1)# exit

DeviceA(config)# interface gigabitethernet 0/2
DeviceA(config-if-GigabitEthernet 0/2)# ip address 172.2.2.2 255.255.255.0
DeviceA(config-if-GigabitEthernet 0/2)# exit
```
# 开启DHCP中继功能。
DeviceA(config)# service dhcp
# 添加DHCP服务器的地址。
DeviceA(config)# ip helper-address 172.2.2.1
(2) 配置Device B
# 配置接口的IP地址。
```bash
DeviceB(config)# interface gigabitethernet 0/1
DeviceB(config-if-GigabitEthernet 0/1)# ip address 172.2.2.1 255.255.255.0
DeviceB(config-if-GigabitEthernet 0/1)# exit
```
# 配置到192.1.1.0/24网段的静态路由，确保与DHCP客户端Host三层路由可达。
DeviceB(config)# ip route 192.1.1.0 255.255.255.0 gigabitethernet 0/1
# 启用DHCP Server功能。
DeviceB(config)# service dhcp
# 配置地址池pool1的网络参数。
```bash
DeviceB(config)# ip dhcp pool pool1
DeviceB(dhcp-config)# network 192.1.1.0 255.255.255.0
DeviceB(dhcp-config)# default-router 192.1.1.1
DeviceB(dhcp-config)# dns-server 192.1.1.2
DeviceB(dhcp-config)# exit
```
### **（6）如何配置DHCP Snooping功能？**
与DHCP中继不同，DHCP Snooping是DHCP的一种安全特性。配置该功能后设备通过侦听在客户端和服务器之间的DHCP交互报文实现对用户IP地址使用情况的记录和监控，同时过滤非法DHCP报文。在配置模式下通过**ip dhcp snooping**开启设备DHCP Snooping功能，然后进入与DHCP Server相连的接口配置模式，通过**ip dhcp snooping trust**命令把该接口配置为TRUST口即可配置成功。下面通过一个典型配置案例来说明DHCP Snooping功能的配置步骤。
l  DHCP Snooping基本功能组网图
![image.png](https://cdn.nlark.com/yuque/0/2023/png/35951150/1684079315794-ee47baf3-d54f-4002-bc44-f01ae7136c21.png#averageHue=%23826d3f&clientId=u1da44472-2496-4&from=paste&id=u31862ab5&originHeight=347&originWidth=273&originalType=url&ratio=1&rotation=0&showTitle=false&size=36400&status=done&style=none&taskId=u5cf745d9-fa20-415d-bc65-38778892343&title=)
l  配置步骤
# 进入全局配置模式。
# 开启DHCP Snooping。
Device(config)# ip dhcp snooping
# 进入上联DHCP Server的接口配置模式。
Device(config)# interface gigabitethernet 0/1
# 将上联口GigabitEthernet 0/1设置为TRUST口。
Device(config-if-GigabitEthernet 0/1)# ip dhcp snooping trust
## 5、IP路由
### **（1）如何配置二层交换机缺省路由？**
在二层设备上，通过**ip default-gateway**指定IPv4默认路由。在数据交互时，将目的地址非本地网段的报文投送到默认网关上，由网关路由器完成下一步的路由选路，达到二层设备与其他网络的网络互通。
# 配置默认网关为192.168.1.1。
```bash
Hostname(config)# ip default-gateway 192.168.1.1
```
# 使用**show ip redirects**命令查看本设备的默认网关。
Hostname# show ip redirects
**Default Gateway: 192.168.1.1**
### **（2）如何配置三层交换机缺省路由？**
三层交换设备以及路由设备上，通过配置缺省网关，在路由选路无法命中精确路由时，将非本地的报文投送到缺省网关上，由网关路由器完成下一步的路由选路，完成本设备与其他网络的网络互通。
# 配置缺省网络为200.200.200.0，只要当200.200.200.0出现在路由表中，该路由才会成为缺省路由。
```bash
Hostname(config)# ip default-network 200.200.200.0
```
# 使用**show ip route**命令查看本设备缺省路由。
```bash
Hostname> enable

Hostname# show ip route

Codes:  C - connected, S - static, R - RIP, B - BGP

O - OSPF, IA - OSPF inter area

N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2

E1 - OSPF external type 1, E2 - OSPF external type 2

i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2

ia - IS-IS inter area, * - candidate default

Gateway of last resort is 200.200.200.0 to network 0.0.0.0
```
### **（3）如何配置IPv4静态路由？**
静态路由由网络管理员手工配置。配置静态路由后，路由表中生成一条静态路由。使用静态路由，转发去远端网络的报文。简单网络中，通过手工配置IPv4静态路由可以实现网络互通。下面通过一个典型举例来说明如何配置IPv4静态路由。
**组网需求**
通过配置静态路由实现IPv4路由可达。
**组网图**
**图6-1 IPv4静态路由组网图**
![image.png](https://cdn.nlark.com/yuque/0/2023/png/35951150/1684079642061-1b1c0ecf-4b48-4b2c-9834-a4593231780a.png#averageHue=%23020101&clientId=u1da44472-2496-4&from=paste&id=u5677115a&originHeight=289&originWidth=572&originalType=url&ratio=1&rotation=0&showTitle=false&size=52047&status=done&style=none&taskId=udd13f76c-050e-4d18-be32-aad6f69b9cb&title=)
**配置要点**
l  配置交换机SW1接口IP
l  配置交换机SW2接口IP
l  配置交换机SW1静态路由
l  配置交换机SW2静态路由
l  保存配置
**配置限制与指导**
l  二层交换机不能配置本功能。
l  三层交换机若配置了**no ip routing**，则不能配置IPv4静态路由，之前已经存在的IPv4静态路由也会被删除。在未重启的情况下，重新配置**ip routing**，可以恢复被清空的IPv4静态路由。重启过后，则无法恢复这些IPv4静态路由。
**配置步骤**
# 配置交换机SW1接口IP。
```bash
SW1(config)# interface GigabitEthernet 0/1
SW1(config-if-GigabitEthernet 0/1)# no switchport
SW1(config-if-GigabitEthernet 0/1)# ip address 192.168.1.254 255.255.255.0

SW1(config-if-GigabitEthernet 0/1)# interface GigabitEthernet 0/2
SW1(config-if-GigabitEthernet 0/2))# no switchport
SW1(config-if-GigabitEthernet 0/2))# ip address 192.168.3.1 255.255.255.0
SW1(config-if-GigabitEthernet 0/2))# exit
```
# 配置交换机SW2接口IP。
```bash
SW2(config)# interface GigabitEthernet 0/1
SW2(config-if-GigabitEthernet 0/1)# no switchport
SW2(config-if-GigabitEthernet 0/1)# ip address 192.168.2.254 255.255.255.0

SW2(config-if-GigabitEthernet 0/1)# interface GigabitEthernet0/25
SW2(config-if-GigabitEthernet 0/2))# no switchport
SW2(config-if-GigabitEthernet 0/2))# ip address 192.168.3.1 255.255.255.0
SW2(config-if-GigabitEthernet 0/2))# exit
```
# 配置交换机SW1静态路由，目的地址是192.168.2.0/24的数据包，转发给192.168.3.2。
SW1(config)# ip route 192.168.2.0 255.255.255.0 192.168.3.2
# 配置交换机SW2静态路由，目的地址是192.168.1.0/24的数据包，转发给192.168.3.1。
SW2(config)# ip route 192.168.1.0 255.255.255.0 192.168.3.1
**验证配置结果**
使用**show ip route**检查设备的路由表，确认有静态路由条目。
#SW1的路由表
```bash
SW1# show ip route

Codes:  C - connected, **S - static**, R - RIP, B - BGP

O - OSPF, IA - OSPF inter area

N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2

E1 - OSPF external type 1, E2 - OSPF external type 2

i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2

ia - IS-IS inter area, * - candidate default

Gateway of last resort is no set

**S    192.168.2.0/24 [1/0] via 192.168.3.2**

C    192.168.3.0/24 is directly connected, GigabitEthernet 0/25

C    192.168.3.1/32 is local host.

C    192.168.1.0/24 is directly connected, FastEthernet 0/1

C    192.168.1.254/32 is local host.
```
#SW2的路由表
```bash
SW2# show ip route

Codes:  C - connected, **S - static**, R - RIP, B - BGP

O - OSPF, IA - OSPF inter area

N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2

E1 - OSPF external type 1, E2 - OSPF external type 2

i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2

ia - IS-IS inter area, * - candidate default

Gateway of last resort is no set

**S    192.168.1.0/24 [1/0] via 192.168.3.1**

C    192.168.3.0/24 is directly connected, GigabitEthernet 0/25

C    192.168.3.2/32 is local host.

C    192.168.2.0/24 is directly connected, FastEthernet 0/1

C    192.168.2.254/32 is local host.
```
### **（4）如何配置IPv6静态路由？**
静态路由由网络管理员手工配置。配置静态路由后，路由表中生成一条静态路由。使用静态路由，转发去远端网络的报文。简单网络中，通过手工配置IPv6静态路由可以实现网络互通。下面通过一个典型举例来说明如何配置IPv6静态路由。
**组网需求**
通过配置静态路由实现IPv6路由可达。
**组网图**
**图6-2 IPv6静态路由组网图**
![image.png](https://cdn.nlark.com/yuque/0/2023/png/35951150/1684079642230-2a5975b1-75cb-4aa2-83c5-e8931adfbf1d.png#averageHue=%23010101&clientId=u1da44472-2496-4&from=paste&id=u34f05e6c&originHeight=382&originWidth=567&originalType=url&ratio=1&rotation=0&showTitle=false&size=71817&status=done&style=none&taskId=u8060fba9-0342-4c33-aa11-7651287af1d&title=)
**配置要点**
l  配置交换机SW1接口IP
l  配置交换机SW2接口IP
l  配置交换机SW1静态路由
l  配置交换机SW2静态路由
l  保存配置
**配置限制与指导**
l  二层交换机不能配置本功能。
l  三层交换机若配置了**no ipv6 unicast- routing**，则不能配置IPv6静态路由，之前已经存在的IPv6静态路由也会被删除。在未重启的情况下，重新配置**ipv6 unicast- routing**，可以恢复被清空的IPv6静态路由。重启过后，则无法恢复这些IPv6静态路由。
**配置步骤**
# 配置交换机SW1接口IP。
```bash
SW1(config)# interface fastethernet 0/1
SW1(config-if-GigabitEthernet 0/1)# no switchport
SW1(config-if-GigabitEthernet 0/1)# ipv6 address 2001::1/64

SW1(config-if-GigabitEthernet 0/1)# interface GigabitEthernet 0/25
SW1(config-if-GigabitEthernet 0/2))# no switchport
SW1(config-if-GigabitEthernet 0/2))# ipv6 address 2003::1/64
SW1(config-if-GigabitEthernet 0/2))# exit
```
# 配置交换机SW2接口IP。
```bash
SW2(config)# interface fastethernet 0/1
SW2(config-if-GigabitEthernet 0/1)# no switchport
SW2(config-if-GigabitEthernet 0/1)# ip address 2002::1/64

SW2(config-if-GigabitEthernet 0/1)# interface GigabitEthernet0/25
SW2(config-if-GigabitEthernet 0/2))# no switchport
SW2(config-if-GigabitEthernet 0/2))# ip address 2003::2/64
SW2(config-if-GigabitEthernet 0/2))# exit
```
# 配置交换机SW1静态路由，目的地址是2002::/64的数据包，转发给2003::2/64。
SW1(config)# ipv6 route 2002::/64 2003::2
# 配置交换机SW2静态路由，目的地址是2001::/64的数据包，转发给2003::1/64。
SW2(config)# ipv6 route 2001::/64 2003::1
**验证配置结果**
使用**show ipv6 route**检查设备的路由表，确认有静态路由条目。
#SW1的路由表
```bash
SW1# show ipv6 route

Codes:  C - connected, **S - static**, R - RIP, B - BGP

O - OSPF, IA - OSPF inter area

N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2

E1 - OSPF external type 1, E2 - OSPF external type 2

i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2

ia - IS-IS inter area, * - candidate default

Gateway of last resort is no set

**S    2002::/64 [1/0] via 2003::2**

C    2003::/64 is directly connected, GigabitEthernet 0/25

C    2003::1/64 is local host.

C    2003::2/64 is directly connected, FastEthernet 0/1

C    2001::1/64 is local host.
```
#SW2的路由表
```bash
SW2# show ipv6 route

Codes:  C - connected, **S - static**, R - RIP, B - BGP

O - OSPF, IA - OSPF inter area

N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2

E1 - OSPF external type 1, E2 - OSPF external type 2

i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2

ia - IS-IS inter area, * - candidate default

Gateway of last resort is no set

**S    2001::1/64 via 2003::1**

C    2003::/64 is directly connected, GigabitEthernet 0/25

C    2003::2/64 is local host.

C    2002::/64 is directly connected, FastEthernet 0/1

C    2002::1/64 is local host.
```
### **（5）如何配置策略路由？**
**功能简介**
策略路由（Policy-Based Routing）是基于策略的路由。将包含策略的路由图应用在接口和设备上，即可实现策略路由。
与静态路由相似，策略路由也是手工配置的路由，不能随网络变化自动更新，仅在本地有效。与静态路由、动态路由相比，策略路由更加灵活。静态路由、动态路由只能依据目的地址转发报文。策略路由可以依据源地址、目的地址、报文长度、入端口等转发报文。
**应用场景**
l  应用场景一：
当您的网络中的汇聚与核心设备，或者是核心与出口路由器之间有多条链路互联时，普通路由表的负载或者主备的结果可能无法满足您的需求，又或者您的网络中引人了一些新的业务，这些网段在您原先的网络设计时没有考虑到，此时出现新的路由访问的需要，您不想去调整前期规划的复杂的OSPF路由控制选路的策略，此时就可以利用策略路由这种技术来针对这部分新的需求进行一个重新的路由选择，可以按照您的意愿选择一条指定的链路转发数据，而不依赖于传统的路由表。
l  应用场景二：
核心到网络出口设备有多台路由器或者防火墙，他们对应的多家不同的运营商链路，比如电信（100M），联通 (50M），教育网（1G）等，此时您希望根据每台链路的负载程度，带宽利用率等情况来将内网中的流量分流到这三条链路上，比如各教学楼，科研所，教师办公区的用户上网全部走教育网出口，图书馆、电教中心、学校行政楼的区域上网全部走联通，其他流量（比如学生宿舍区）全部都走电信，另外访问教育网资源的数据全部走教育网出口。基于上面的业务类型进行分流，同时电信，联通，教育网又彼此作为各自的链路故障时候的备份，如果您有这样的组网需求，就可以考虑采用策略路由进行选路。
下面通过一个典型策略路由配置举例来说明如何配置策略路由。
**组网需求**
在设备Device上配置策略路由，实现如下目的：
来自Host A（200.24.16.2/24）的报文，优先从GigabitEthernet 0/1接口发出。
来自Host B（200.24.17.2/24）的报文，优先从GigabitEthernet 0/2接口发出。
两条出口链路互为备份，配置与Track联动，故障时能够快速切换备份链路。
**组网图**
**图6-3 策略路由实现多出口高可用组网图**
![image.png](https://cdn.nlark.com/yuque/0/2023/png/35951150/1684079642162-902784b7-84ac-47ff-bfe7-cd2294a5091c.png#averageHue=%23020101&clientId=u1da44472-2496-4&from=paste&id=ueac0582d&originHeight=431&originWidth=380&originalType=url&ratio=1&rotation=0&showTitle=false&size=44272&status=done&style=none&taskId=ue2d7613f-689e-4c9a-bae1-3dffa5f63af&title=)
**配置要点**
l  配置两个不同的ACL，分别用来匹配Host A网段和Host B网段。
l  配置路由图RM_FOR_PBR：策略10实现“来自Host A网段的报文，优先从GigabitEthernet 0/1接口发出”；策略20实现“来自Host B网段的报文，优先从GigabitEthernet 0/2接口发出”。
l  设置策略路由在多个下一跳之间实现冗余备份。
l  设置Track规则，并与策略路由联动。
l  配置策略路由，对GigabitEthernet 0/3接口收到的报文应用路由图RM_FOR_PBR。
**配置限制与指导**
l  配置策略路由时必须引用路由图。因此，必须在设备上配置路由图。
l  如果配置路由图时引用了ACL，则必须在设备上配置ACL。
l  如果策略路由中引用的路由图实际不存在，则此策略路由不生效。
**配置步骤**
# 配置接口IP，实现网络互通。（略）
# 配置ACL规则，分别匹配网段200.24.16.0/24和200.24.17.0/24。
```bash
Device(config)# access-list 1 permit 200.24.16.0 0.0.0.255
Device(config)# access-list 2 permit 200.24.17.0 0.0.0.255
```
# 配置track规则。
```bash
Device(config)# ip rns 1
Device(config-ip-rns)# icmp-echo 200.24.18.1
Device(config-ip-rns)# exit
Device(config)# ip rns schedule 1 start-time now life forever
Device(config)# track 1 rns 1
Device(config)# ip rns 2
Device(config-ip-rns)# icmp-echo 200.24.19.1
Device(config-ip-rns)# exit
Device(config)# ip rns schedule 2 start-time now life forever
Device(config)# track 2 rns 2
```
# 配置路由策略RM_FOR_PBR，200.24.16.0的下一跳为200.24.18.1，备份下一跳为200.24.19.1；200.24.17.0的下一跳为200.24.19.1，备份下一跳为200.24.18.1。
```bash
Device(config)# route-map RM_FOR_PBR 10
Device(config-route-map)# match ip address 1
Device(config-route-map)# set ip next-hop verify-availability 200.24.18.1 track 1
Device(config-route-map)# set ip next-hop verify-availability 200.24.19.1 track 2
Device(config-route-map)# exit
Device(config)# route-map RM_FOR_PBR 20
Device(config-route-map)# match ip address 2
Device(config-route-map)# set ip next-hop verify-availability 200.24.19.1 track 2
Device(config-route-map)# set ip next-hop verify-availability 200.24.18.1 track 1
Device(config-route-map)# exit
```
# 接口0/3上生效路由图RM_FOR_PBR，并开启负载均衡选路。
```bash
Device(config)# interface GigabitEthernet 0/3
Device(config-if-GigabitEthernet 0/3)# ip policy route-map RM_FOR_PBR
Device(config-if-GigabitEthernet 0/3)# exit
Device(config)# ip policy redundance
```
**验证配置结果**
# 检查策略路由配置信息，确认接口上应用了路由图。
```bash
Device# show ip policy
Balance mode: redundance

Interface　　　　　　　　　　　　　　　 Route map

GigabitEthernet 0/3　　　　　　　　　　 RM_FOR_PBR

!
```
# 检查路由图配置信息，确认策略规则。
```bash
Device# show route-map

route-map RM_FOR_PBR, permit, sequence 10

Match clauses:

ip address 1

Set clauses:

ip next-hop 200.24.18.1

ip next-hop 200.24.19.1

route-map RM_FOR_PBR, permit, sequence 20

Match clauses:

ip address 2

Set clauses:

ip next-hop 200.24.19.1

ip next-hop 200.24.18.1
```
# 检查ACL配置信息，确认报文过滤规则。
```bash
Device# show access-lists

ip access-list standard 1

10 permit 200.24.16.0 0.0.0.255

10 permit 200.24.16.0 0.0.0.255

ip access-list standard 2

10 permit 200.24.17.0 0.0.0.255
```
# 检查Track的跟踪对象是否Up。
```bash
Device# show track

Track 1

Reliable Network Service 1

The state is Up

1 change, current state last: 120 secs

Delay up 30 secs, down 50 secs

Track 2

Reliable Network Service 2

The state is Up

1 change, current state last: 130 secs

Delay up 30 secs, down 50 secs
```
### **（6）如何配置OSPF的基本功能？**
**功能简介**
OSPF（Open Shortest Path First）为 IETF OSPF 工作组开发的一种基于链路状态的内部网关路由协议。OSPF 是专为 IP 开发的路由协议，直接运行在 IP 层上面，协议号为 89，采用组播方式进行 OSPF 包交换，组播地址为 224.0.0.5 （全部 OSPF 设备）和 224.0.0.6（指定设备）。当 OSPF 路由域规模较大时，一般采用分层结构，即将 OSPF 路由域分割成几个区域（AREA），区域之间通过一个骨干区域（AREA 0）互联，每个非骨干区域都需要直接与骨干区域连接。下面通过一个配置举例来说明如何实现。下面通过一个典型配置举例来说明如何通过路由器或交换机运行ospf协议使全网路由可达。
**组网需求**
所有的设备都运行OSPF，一共划分3个区域，Device A和Device B作为ABR转发区域间路由，以此实现所有网络的互联互通。配置完成后，所有设备都能学习到自治系统内的所有网段的路由，并且邻居关系正确。
**组网图**
**图6-4 OSPF基本功能组网图**
![image.png](https://cdn.nlark.com/yuque/0/2023/png/35951150/1684079642205-a2100bb5-3de0-42e8-9b68-0346ea3e5748.png#averageHue=%23999f80&clientId=u1da44472-2496-4&from=paste&id=u72755edf&originHeight=342&originWidth=820&originalType=url&ratio=1&rotation=0&showTitle=false&size=78283&status=done&style=none&taskId=u0ff59923-ea00-40d6-96cd-f6e64920f9a&title=)
**配置要点**
l  在所有设备上配置接口IP地址。
l  在所有设备上启动IPv4单播路由功能（该功能默认已开启）。
l  在所有设备上配置OSPF实例、Router ID。
l  在所有设备上配置接口配置OSPF。
**配置限制与指导**
l  需要确保IP单播路由功能启用，即**ip routing**开关未被关闭，才能够启用OSPF。
l  开启OSPF路由功能时，建议手工配置Router ID。
l  配置**ip ospf disable all**后，即使接口属于该**network**命令通告范围，也不再接收和发送任何OSPF报文，也不参与OSPF的计算。
**配置步骤**
(1) 在所有设备上配置接口IP地址。
```bash
# Device A的配置。

Device A(config)# interface gigabitethernet 0/1

Device A(config-if-GigabitEthernet 0/1)# ip address 192.168.1.1 255.255.255.0

Device A(config-if-GigabitEthernet 0/1)# exit

Device A(config)# interface gigabitethernet 0/2

Device A(config-if-GigabitEthernet 0/2)# ip address 192.168.2.1 255.255.255.0

Device A(config-if-GigabitEthernet 0/2)# exit
```
Device B的配置。
```bash
Device B(config)# interface gigabitethernet 0/1
Device B(config-if-GigabitEthernet 0/1)# ip address 192.168.1.2 255.255.255.0
Device B(config-if-GigabitEthernet 0/1)# exit

Device B(config)# interface gigabitethernet 0/2
Device B(config-if-GigabitEthernet 0/2)# ip address 192.168.3.1 255.255.255.0
Device B(config-if-GigabitEthernet 0/2)# exit
```
Device C的配置。
```bash
Device C(config)# interface gigabitethernet 0/3
Device C(config-if-GigabitEthernet 0/3)# ip address 192.168.2.2 255.255.255.0
```
Device D的配置。
```bash
Device D(config)# interface gigabitethernet 0/3
Device D(config-if-GigabitEthernet 0/3)# ip address 192.168.3.2 255.255.255.0
```
(2) 配置OSPF实例、Router ID，并将接口地址加入OSPF。
Device A的配置。
```bash
Device A(config)# router ospf 1
Device A(config-router)# router-id 192.168.1.1
Device A(config-router)# network 192.168.1.0 0.0.0.255 area 0
Device A(config-router)# network 192.168.2.0 0.0.0.255 area 1
```
Device B的配置。
```bash
Device B(config)# router ospf 1
Device B(config-router)# router-id 192.168.1.2
Device B(config-router)# network 192.168.1.0 0.0.0.255 area 0
Device B(config-router)# network 192.168.3.0 0.0.0.255 area 2
```
Device C的配置。
```bash
Device C(config)# router ospf 1
Device C(config-router)# router-id 192.168.2.2
Device C(config-router)# network 192.168.2.0 0.0.0.255 area 1
```
Device D的配置。
```bash
Device D(config)# router ospf 1
Device D(config-router)# router-id 192.168.3.2
Device D(config-router)# network 192.168.3.0 0.0.0.255 area 2
```
**验证配置结果**
(1) 检查Device A的OSPF邻居和路由。
Device A的OSPF路由。
```bash
Device A# show ip route ospf
O IA 192.168.3.0/24 [110/2] via 192.168.1.2, 00:18:03, GigabitEthernet 0/1
```
Device A的邻居信息。
```bash
Device A# show ip ospf neighbor

OSPF process 1, 2 Neighbors, 2 is Full:

Neighbor ID　 Pri　 State　　　Dead Time　 Address　　　 Interface

192.168.1.2　 1　　 Full/DR　　00:00:40　　192.168.1.2　 GigabitEthernet 0/1

192.168.2.2　 1　　 Full/BDR　 00:00:34　　192.168.2.2　 GigabitEthernet 0/2
```
(2) 检查Device B的OSPF邻居和路由。
Device B的OSPF路由。
```bash
Device B# show ip route ospf

O IA 192.168.2.0/24 [110/2] via 192.168.1.2, 00:18:03, GigabitEthernet 0/1
```
Device B的邻居信息。
```bash
Device B# show ip ospf neighbor

OSPF process 1, 2 Neighbors, 2 is Full:

Neighbor ID　 Pri　 State　　　Dead Time　 Address　　　 Interface

192.168.1.1　 1　　 Full/BDR　 00:00:32　　192.168.1.1　 GigabitEthernet 0/1

192.168.3.2　 1　　 Full/BDR　 00:00:30　　192.168.3.2　 GigabitEthernet 0/2
```
(3) 检查Device C的OSPF邻居和路由。
Device C的OSPF路由。
```bash
Device C# show ip route ospf

O IA 192.168.1.0/24 [110/2] via 192.168.2.1, 00:19:05, GigabitEthernet 0/3

O IA 192.168.3.0/24 [110/3] via 192.168.2.1, 00:19:05, GigabitEthernet 0/3
```
Device C的邻居信息。
```bash
Device C# show ip ospf neighbor

OSPF process 1, 1 Neighbors, 1 is Full:

Neighbor ID　 Pri　 State　　　Dead Time　 Address　　　 Interface

192.168.1.1　 1　　 Full/BDR　 00:00:32　　192.168.2.1　 GigabitEthernet 0/3
```
(4) 检查Device D的OSPF邻居和路由。
Device D的OSPF路由。
```bash
Device D# show ip route ospf

O IA 192.168.1.0/24 [110/2] via 192.168.3.1, 00:19:05, GigabitEthernet 0/3

O IA 192.168.2.0/24 [110/3] via 192.168.3.1, 00:19:05, GigabitEthernet 0/3
```
Device D的邻居信息。
```bash
Device D# show ip ospf neighbor

OSPF process 1, 1 Neighbors, 1 is Full:

Neighbor ID　 Pri　 State　　　Dead Time　 Address　　　 Interface

192.168.1.2　 1　　 Full/BDR　 00:00:30　　192.168.3.1　 GigabitEthernet 0/3
```
# 在Device D上检测到地址192.168.2.2的网络可达性。
```bash
Device D# ping 192.168.2.2

Sending 5, 100-byte ICMP Echoes to 192.168.2.2, timeout is 2 seconds：

< press Ctrl+C to break >

!!!!!

Success rate is 100 percent (5/5), round-trip min/avg/max = 1/1/1 ms.
```
**常见错误**
l  IP单播路由功能被关闭，OSPF协议无法启用。
l  **network**命令配置的网段范围未包含接口IP地址。
l  相连接口配置的Area ID不一致。
l  多台设备上配置了相同的Router ID，导致Router ID冲突。
l  多台设备上配置了相同的接口IP地址，导致OSPF网络运行错误。
### **（7）如何配置OSPF Stub区域？**
**功能简介**
在OSPF域的一个末节区域，比如就一台设备，单链路与核心骨干区域连接，这台设备的性能可能还比较低，内存，CPU都比较紧张，另外不论路由条目详细还是宽泛都区别不大，因为这个区域需要访问其他区域，或者是OSPF域外的网段的时候，他的路由的下一跳都是这个单链路所对应的下一跳核心设备的IP，所以这个区域没有必要学习到大量的OSPF外部路由，此时就可以考虑将该区域配置成stub区域，以减轻这个区域的路由条目的压力与计算的资源消耗。
stub区域为OSPF的末节区域，能够过滤掉 4类、5类LSA（这样就不会接收到OSPF域外的路由），能够减小链路状态数据库及路由表。该区域的ABR会为stub区域产生一条域间的O *IA  0/0的默认路由，下发到该区域，保证到OSPF域外的路由可达性。下面通过一个配置举例来说明如何配置ospf的Stub区域。
**组网需求**
Device A、B、C和D之间通过OSPF路由协议互联。
Device A和Device B作为ABR传递OSPF区域间路由，Device D作为ASBR引入外部静态路由。
为减少Area 1内LSA数量，节约设备性能，将Area 1配置成Totally Stub区域。
**组网图**
**图6-5 OSPF Stub区域组网图**
![image.png](https://cdn.nlark.com/yuque/0/2023/png/35951150/1684079642159-8913cbad-c44a-4552-9d51-6a778ec6330d.png#averageHue=%237a613c&clientId=u1da44472-2496-4&from=paste&id=ua396d475&originHeight=291&originWidth=750&originalType=url&ratio=1&rotation=0&showTitle=false&size=47114&status=done&style=none&taskId=u4005650b-71ad-4f9f-8b6e-5da63849251&title=)
**配置要点**
l  所有设备配置接口IP地址（略）。
l  所有设备配置OSPF基本功能（略）。
l  在Device A和Device C上配置区域1为Stub类型。
**配置步骤**
(1) Device D上配置引入外部静态路由。
```bash
Device D(config)# router ospf 1
Device D(config-router)# redistribute static subnets
```
(2) Device A、C上区域1配置成Stub类型。
Device A的配置。
```bash
Device A(config)# router ospf 1
Device A(config-router)# area 1 stub no-summary
```
Device C的配置。
```bash
Device C(config)# router ospf 1
Device C(config-router)# area 1 stub
```
**验证配置结果**
# 在Device C上查看路由表，确认只有一条默认区域间路由，而没有Device D引入的外部静态路由。
```bash
Device C# show ip route ospf
O*IA 0.0.0.0/0 [110/2] via 192.168.2.1, 00:30:53, GigabitEthernet 0/2
```
### **（8）如何配置OSPF NSSA区域？**
**功能简介**
在OSPF域的一个末节区域，比如就一台设备，单链路与核心骨干区域连接，这台设备的性能可能还比较低，内存，CPU都比较紧张，所以该区域可以不必引人OSPF域外的路由，以减轻这个区域的路由条目的压力与计算的资源消耗，我们优先想到的是stub区域来满足。但是这个区域还有一个特别之处就是自身需要引人另外一个OSPF域外部的路由进入这个OSPF域，由于stub区域过滤LSA4，LSA5无法满足这个需求，所以NSSA区域引人了一个机制，就是将LSA5 转换为LSA7，从而实现LSA7在NSSA区域的传递，实现引人OSPF域外部路由。当您的网络满足上述的需求特点的时候就可以考虑配置NSSA区域来解决。
NSSA区域为OSPF的末节区域，能够过滤掉 4类、5类LSA（这样就不会接收到OSPF域外的路由），能够减小链路状态数据库及路由表。但是该区域可能还需要通过重分布引人另一个OSPF域外的路由，这样保证OSPF域内能够通过该NSSA区域到外部路由可达，stub区域针对外部路由的LSA 5是无法在该区域传递的，所以NSSA区域引人了一个机制，就是将LSA5 转换为LSA7，从而实现LSA7在NSSA区域的传递，实现引入OSPF域外部路由。下面通过一个配置举例来说明如何配置ospf的NSSA区域。
**组网需求**
l  Device A、B、C之间通过OSPF路由协议互联。
l  Device B作为ABR传递OSPF区域间路由，Device C作为ASBR引入了外部静态路由。
l  为减少Area 1内LSA数量，节约设备性能，Area 1配置成NSSA区域。
**组网图**
**图6-6 OSPF NSSA区域组网图**
![image.png](https://cdn.nlark.com/yuque/0/2023/png/35951150/1684079643262-0bef9902-4ff1-4a38-ac84-ed04bdb92653.png#averageHue=%237a6037&clientId=u1da44472-2496-4&from=paste&id=u7f755623&originHeight=254&originWidth=698&originalType=url&ratio=1&rotation=0&showTitle=false&size=39072&status=done&style=none&taskId=u19a7c76d-566c-4b82-a013-6b02ea52e74&title=)
**配置要点**
l  所有设备配置接口IP地址（略）。
l  所有设备配置OSPF基本功能（略）。
l  Device C上需要将外部静态路由引入OSPF进程。
l  需要分别在Device B、C上将区域1配置成NSSA。
**配置步骤**
(1) Device C配置静态路由。
Device C(config)# ip route 172.10.10.0 255.255.255.0 192.168.6.2
(2) Device D上配置引入外部静态路由。
```bash
Device D(config)# router ospf 1
Device D(config-router)# redistribute static subnets
```
(3) Device B、C上区域1配置成NSSA。
Device B的配置。
```bash
Device B(config)# router ospf 1
Device B(config-router)# area 1 nssa
```
Device C的配置。
Device C(config-router)# area 1 nssa
**验证配置结果**
Device D上查看生成172.10.10.0/24的7类LSA。
```bash
Device D# show ip ospf database nssa-external

OSPF Router with ID (192.168.6.2) (Process ID 1)

NSSA-external Link States (Area 0.0.0.1 [NSSA])

LS age: 61

Options: 0x8 (-|-|-|-|N/P|-|-|-)

LS Type: AS-NSSA-LSA

Link State ID: 172.10.10.0 (External Network Number For NSSA)

Advertising Router: 192.168.6.2

LS Seq Number: 80000001

Checksum: 0xc8f8

Length: 36

Network Mask: /24

Metric Type: 2 (Larger than any link state path)

TOS: 0

Metric: 20

NSSA: Forward Address: 192.168.6.2

External Route Tag: 0
```
Device B上查看172.10.10.0/24同时存在5类和7类LSA。
```bash
Device B# show ip ospf database nssa-external

OSPF Router with ID (192.168.3.1) (Process ID 1)

NSSA-external Link States (Area 0.0.0.1 [NSSA])

LS age: 314

Options: 0x8 (-|-|-|-|N/P|-|-|-)

LS Type: AS-NSSA-LSA

Link State ID: 172.10.10.0 (External Network Number For NSSA)

Advertising Router: 192.168.6.2

LS Seq Number: 80000001

Checksum: 0xc8f8

Length: 36

Network Mask: /24

Metric Type: 2 (Larger than any link state path)

TOS: 0

Metric: 20

NSSA: Forward Address: 192.168.6.2

External Route Tag: 0
```
Device B上查看生成了172.10.10.0/24的N2类型的路由。
```bash
Device B# show ip ospf database external

OSPF Router with ID (192.168.3.1) (Process ID 1)

AS External Link States

LS age: 875

Options: 0x2 (-|-|-|-|-|-|E|-)

LS Type: AS-external-LSA

Link State ID: 172.10.10.0 (External Network Number)

Advertising Router: 192.168.3.1

LS Seq Number: 80000001

Checksum: 0xd0d3

Length: 36

Network Mask: /24

Metric Type: 2 (Larger than any link state path)

TOS: 0

Metric: 20

Forward Address: 192.168.6.2

External Route Tag: 0

!
```
**常见错误**
l  同一区域中的设备，区域类型配置不一致。
l  在Stub区域中配置路由重分布，将无法加入外部路由。
## 六、ACL和QoS
### **（1）如何配置ACL？**
(1) 进入全局配置模式，通过**access-list**命令配置ACL功能。
ｏ    配置IP标准ACL，通过源IP地址的过滤，实现基于IP报文控制用户访问网络资源的目的。
Hostname(config)# access-list 1 permit host 192.168.1.2
ｏ    配置扩展ACL。通过源/目的IP地址、IP协议号、四层源（或者目的）端口号的过滤，实现基于IP报文控制用户访问网络资源的目的。
Hostname(config)# access-list 100 permit tcp host 192.168.1.2 host 192.168.2.3
ｏ    配置专家级ACL。通过对报文的二层和三层信息对进出设备的报文进行精细化控制，实现控制用户访问网络资源的目的。
Hostname(config)# access-list 2700 permit icmp host 192.168.3.1 any host 192.18.10.1 any
ｏ    配置MAC扩展ACL。通过对二层报文头的过滤，实现控制用户访问网络资源的目的。
Hostname(config)# access-list 700 permit 0010.0000.1102 00e0.f800.000d any etype-any
ｏ    配置IPv6 ACL。通过对进出设备的IPv6报文进行精细化控制，实现控制IPv6用户访问网络资源的目的。
```bash
Hostname(config)#ipv6 access-list ipv6
Hostname(config-ipv6-acl)#deny ipv6 any host 1002::2
```
(2) 将ACL应用在接口上。
Hostname(config)# interface gigabitethernet 0/1
ｏ    将标准ACL1应用在接口GigabitEthernet 0/1的出方向。
Hostname(config-if-GigabitEthernet 0/1)# ip access-group 1 out
ｏ    将扩展ACL 100应用在接口GigabitEthernet 0/1的出方向。
Hostname(config-if-GigabitEthernet 0/1)# ip access-group 100 out
ｏ    将专家级ACL 2700应用在接口GigabitEthernet 0/1的出方向。
Hostname(config-if-GigabitEthernet 0/1)# ip access-group 2700 out
ｏ    将MAC扩展ACL 700应用在接口GigabitEthernet 0/1的出方向。
Hostname(config-if-GigabitEthernet 0/1)# mac access-group 700 out
ｏ    将IPv6 ACL ipv6应用在接口GigabitEthernet 0/1的入方向。
Hostname(config-if-GigabitEthernet 0/1)# ipv6 traffic-filter ipv6 in
(3) 通过**show access-list**命令查看配置结果。
```bash
Hostname# show access-lists
ip access-list standard 1
10 permit host 192.168.1.2
ip access-list extended 100
10 permit tcp host 192.168.1.2 host 192.168.2.3
mac access-list extended 700
10 permit 0010.0000.1102 00e0.f800.000d any etype-any
expert access-list extended 2700
10 permit icmp host 192.168.3.1 any host 192.18.10.1 any
ipv6 access-list ipv6
10 deny ipv6 any host 1002::2
```
(4) 通过**show access-group**命令查看ACL的应用情况。
```bash
Hostname# show access-group
ip access-group 1 out
ip access-group 100 out
ip access-group 2700 out
mac access-group 700 out
ipv6 traffic-filter ipv6 in
Applied On interface GigabitEthernet 0/1
```
### **（2）如何配置QoS接口限速功能？**
通过在接口上配置命令**rate-limit** { **input** | **output** } _rate-value_ _burst-value_实现接口限速。
l  参数说明
**input**：配置接口输入方向流量限制。
**output**：配置接口输出方向流量限制。
_rate-value_：配置流量限制值。取值范围在不同产品与版本上可能存在差异，单位为千比特每秒。
_burst-value_：配置猝发流量限制值。取值范围在不同产品与版本上可能存在差异，单位为千字节。
l  配置举例
```bash
Hostname(config)#interface gigabitEthernet 0/1
Hostname(config-if-GigabitEthernet 0/1)#rate-limit input 100000 1024
Hostname(config-if-GigabitEthernet 0/1)#rate-limit output 100000 1024
```
### **（3）如何通过ACL实现IP网段的访问权限控制？**
通过配置ACL，可以实现对IP网段访问权限的控制。参考例子如下描述。
组网需求：作为公司核心业务，除了财务部外的其他部门禁止访问公司的财务数据服务器。
**图7-1 组网拓扑图**
![image.png](https://cdn.nlark.com/yuque/0/2023/png/35951150/1684080154444-3e25cfe3-f85b-4eee-b2d3-69b7060eb850.png#averageHue=%235aabaa&clientId=u1da44472-2496-4&from=paste&id=u6de21a75&originHeight=440&originWidth=410&originalType=url&ratio=1&rotation=0&showTitle=false&size=44670&status=done&style=none&taskId=u18ac45db-4c6c-46b5-95ea-c1dd43c9940&title=)
配置步骤：
Device A配置IP标准ACL并添加访问规则。
```bash
DeviceA(config)# ip access-list standard 1
DeviceA(config-std-nacl)# permit 10.1.1.0 0.0.0.255
DeviceA(config-std-nacl)# deny 11.1.1.1 0.0.0.255
DeviceA(config-std-nacl)# exit
```
# 将ACL应用在Device A连接财务数据服务器接口的出方向上。
```bash
DeviceA(config)# interface gigabitethernet 0/3
DeviceA(config-if-GigabitEthernet 0/3)# ip access-group 1 out
```
